Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_ssi_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_SSI
 * @{
 * @brief rtl8735b_SSI Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t SSI_CTRLR0 ;                             /*!<  SSI Control Register 0 register,  Address offset: 0x000 */
	__IO uint32_t SSI_CTRLR1 ;                             /*!<  SSI Control Register 1 register,  Address offset: 0x004 */
	__IO uint32_t SSI_SSIENR ;                             /*!<  SSI Enable Register register,  Address offset: 0x008 */
	__IO uint32_t SSI_MWCR ;                               /*!<  Microwire Control Register register,  Address offset: 0x00C */
	__IO uint32_t SSI_SER ;                                /*!<  Slave Enable Register register,  Address offset: 0x010 */
	__IO uint32_t SSI_BAUDR ;                              /*!<  Baud Rate Select Register register,  Address offset: 0x014 */
	__IO uint32_t SSI_TXFTLR ;                             /*!<  Transmit FIFO Threshold Level register,  Address offset: 0x018 */
	__IO uint32_t SSI_RXFTLR ;                             /*!<  Receive FIFO Threshold Level register,  Address offset: 0x01C */
	__IO uint32_t SSI_TXFLR ;                              /*!<  Transmit FIFO Level Register register,  Address offset: 0x020 */
	__I  uint32_t SSI_RXFLR ;                              /*!<  Receive FIFO Level Register register,  Address offset: 0x024 */
	__I  uint32_t SSI_SR ;                                 /*!<  Status Register register,  Address offset: 0x028 */
	union {
		__IO uint32_t SSI_IMR ;                                /*!<  Interrupt Mask Register register,  Address offset: 0x02C */
		__IO uint32_t SSI_IMR_SLV ;                            /*!<  Interrupt Mask of RTK-SPI Slave Register register,  Address offset: 0x02C */
	};
	union {
		__I  uint32_t SSI_ISR ;                                /*!<  Interrupt Status Register register,  Address offset: 0x030 */
		__I  uint32_t SSI_ISR_SLV ;                            /*!<  Interrupt Status Register register,  Address offset: 0x030 */
	};
	union {
		__I  uint32_t SSI_RISR ;                               /*!<  Raw Interrupt Status Register register,  Address offset: 0x034 */
		__I  uint32_t SSI_RISR_SLV ;                           /*!<  Raw Interrupt Status Register register,  Address offset: 0x034 */
	};
	__I  uint32_t SSI_TXOICR ;                             /*!<  Transmit FIFO Overflow Interrupt Clear Register register,  Address offset: 0x038 */
	__I  uint32_t SSI_RXOICR ;                             /*!<  Receive FIFO Overflow Interrupt Clear Register register,  Address offset: 0x03C */
	__I  uint32_t SSI_RXUICR ;                             /*!<  Receive FIFO Underflow Interrupt Clear Register register,  Address offset: 0x040 */
	union {
		__I  uint32_t SSI_MSTICR ;                             /*!<  Multi-Master Interrupt Clear Register register,  Address offset: 0x044 */
		__I  uint32_t SSI_FAEICR ;                             /*!<  Frame Alignment Interrupt Clear Register register,  Address offset: 0x044 */
	};
	__I  uint32_t SSI_ICR ;                                /*!<  Interrupt Clear Register register,  Address offset: 0x048 */
	__IO uint32_t SSI_DMACR ;                              /*!<  DMA Control Register register,  Address offset: 0x04C */
	__IO uint32_t SSI_DMATDLR ;                            /*!<  DMA Transmit Data Level Register register,  Address offset: 0x050 */
	__IO uint32_t SSI_DMARDLR ;                            /*!<  DMA Receive Data Level Register register,  Address offset: 0x054 */
	__I  uint32_t SSI_TXUICR ;                             /*!<  Transmit FIFO Underflow Interrupt Clear Register register,  Address offset: 0x058 */
	__I  uint32_t SSI_SSRICR ;                             /*!<  SS_N Rising Edge Detect Interrupt Clear Register register,  Address offset: 0x05C */
	__IO uint32_t SSI_DR ;                                 /*!<  Data Register register,  Address offset: 0x060 */
	__IO uint32_t RSVD0[35];                               /*!<  Reserved,  Address offset:0x64-0xEC */
	__IO uint32_t SSI_RX_SAMPLE_DLY ;                      /*!<  Rx Sample Delay Register register,         Address offset: 0x0F0 */
} SSI_TypeDef;
/** @} */

#endif
